export const jingdatas = [
    "1분자기소개",

    "소통과협업을필요로하는일을하고싶다고깨달은계기(이유)",
    
    "스터디모집방법",
    
    "스터디인원구성",

    "스터디운영방법",
    
    "스터디공부내용",
    
    "스터디로부터얻은것",
    
    "비전공자인데개발을선택한이유",
    
    "어떤개발자로성장하고싶은가",
    
    "원하는직무",
    
    "전공을선택한이유",
    
    "전공은무엇을배우는학과인가",
    
    "학점",
    
    "휴학",
    
    "많은교육중에왜ssafy인가(지원동기)",
    
    "ssafy가나를뽑아야하는이유",
    
    "ssafy과정을어떻게버틸것인가(끈기)",
    
    "ssafy수료이후의모습/목표",
    
    "ssafy에불합격한다면",
    
    "장점",
    
    "단점",
    
    "리더형/팔로워형",
    
    "좌우명",
    
    "성공경험",
    
    "실패경험",
    
    "도전정신이드러난경험",
    
    "협업중팀원과의갈등경험",
    
    "희생경험",
    
    "스트레스해소방법",
    
    "마지막으로할말",
    ]

    export function getRandomElement(arr:any[]) {
        const randomIndex = Math.floor(Math.random() * arr.length);
        return arr[randomIndex];
    }
      