// export default async function TermOfUsage(){


//     return(
//         <>

// <h1>제 1조 [목적]</h1>
// <p>
// 이 이용약관(이하 '약관'이라 합니다.)은 머그인(이하 '사이트'라 합니다.)가 제공하는 백준 온라인 저지 및 백준 온라인 저지 관련 제반 서비스(이하 '서비스'라 합니다.)를 이용고객 (이하 '회원'이라 합니다.)이 이용함에 있어서 사이트와 회원과의 권리, 의무 및 책임사항, 기타 필요한 사항을 구체적으로 규정함을 목적으로 합니다.
// </p>
// <h1>제2조 [용어의 정의]</h1>
// <p>
// 이 약관에서 사용하는 용어의 정의는 다음과 같습니다.
// 서비스 : 구현되는 단말기와 상관없이 회원 혹은 웹사이트 방문자가 이용할 수 있는 머그인 서비스를 의미합니다.
// 회원 : 사이트의 서비스에 접속하여 본 약관에 따라 사이트와 이용계약을 체결하고 사이트가 제공하는 서비스를 이용하는 고객을 말합니다.
// 이용계약 : 이 약관을 포함하여 서비스 이용과 관련하여 사이트와 회원 간에 체결하는 모든 계약을 말합니다.
// 해지 : 사이트 또는 회원이 이용계약을 해약하는 것을 말합니다.
// 문제 : 서비스에 업로드되어있는 문제를 말합니다.
// 이 약관에서 사용하는 용어 중 제1항에서 정하지 아니한 것은 관계 법령 및 서비스 별 안내에서 정하는 바에 따르며, 그 외에는 일반 관례에 따릅니다.
// </p>

// <h1>제3조 [약관 효력 및 변경]</h1>
// <p>
// 이 약관은 그 내용을 사이트의 웹사이트에 게시하거나 기타의 방법으로 회원에게 공지함으로 효력이 발생합니다.
// 사이트는 약관의규제에관한법률, 정보통신망이용촉진및정보보호등에관한법률(이하 정보통신망법) 등 관련법을 위배하지 않는 범위에서 사전 고지 없이 이 약관의 내용을 변경할 수 있으며, 변경된 약관은 제1항과 같은 방법으로 공지 또는 통지함으로 효력이 발생됩니다.
// 회원은 정기적으로 웹사이트에 방문하여 약관의 변경사항을 확인하여야 합니다. 변경된 약관에 대한 정보를 알지 못해 발생하는 회원의 피해는 사이트에서 책임지지 않습니다. 단 회원에게 불리한 약관의 개정의 경우에는 공지 외에 일정기간 전자우편, 쪽지, 로그인시 동의양식 등의 전자적 수단을 통해 따로 명확히 통지하도록 합니다.
// 회원은 변경된 약관에 동의하지 않을 경우 회원탈퇴를 요청할 수 있습니다. 변경된 약관의 효력발생일 이후에도 서비스를 계속 이용할 경우 약관의 변경사항에 동의한 것으로 간주됩니다.
// </p>

// <h1>제4조 [약관 외 준칙]</h1>
// <p>사이트는 필요한 경우 서비스 내의 개별항목에 대하여 개별약관 또는 운영원칙(이하 '서비스 별 안내'라 합니다.)를 정할 수 있으며, 회원은 각 서비스 별 안내에 대해 회원가입과 동시에 동의한 것으로 간주합니다. 본 약관과 서비스 별 안내의 내용이 상충되는 경우에는 서비스 별 안내의 내용을 우선하여 적용합니다.
// </p>

// <h1>제5조 [이용계약 체결]</h1>
// <p>
// 이용계약은 회원이 되고자 하는 자(이하 가입신청자)가 약관의 내용에 대하여 동의를 한 다음 회원가입신청을 하고 사이트가 이러한 신청에 대하여 승낙함으로써 체결됩니다.
// 사이트는 가입신청자의 신청에 대하여 서비스 이용을 승낙함을 원칙으로 합니다. 다만, 사이트는 다음 각 호에 해당하는 신청에 대하여는 승낙을 하지 않거나 사후에 이용계약을 해지할 수 있습니다.
// 가입 신청자가 이 약관에 의하여 이전에 회원자격을 상실한 적이 있는 경우, 단 사이트의 회원 재가입 승낙을 얻은 경우에는 예외로 함.
// 실명이 아니거나 타인의 명의를 이용한 경우
// 허위의 정보를 기재하거나, 사이트가 제시하는 내용을 기재하지 않은 경우
// 14세 미만 아동이 법정대리인(부모 등)의 동의를 얻지 아니한 경우
// 이용자의 귀책사유로 인하여 승인이 불가능하거나 기타 규정한 제반 사항을 위반하며 신청하는 경우
// 제1항에 따른 신청에 있어 사이트는 회원의 종류에 따라 전문기관을 통한 실명확인 및 본인인증을 요청할 수 있습니다.
// 사이트는 서비스관련설비의 여유가 없거나, 기술상 또는 업무상 문제가 있는 경우에는 승낙을 유보할 수 있습니다.
// 제2항과 제4항에 따라 회원가입신청의 승낙을 하지 아니하거나 유보한 경우, 사이트는 원칙적으로 이를 가입신청자에게 알리도록 합니다.
// 이용계약의 성립 시기는 사이트가 가입완료를 신청절차 상에서 표시한 시점으로 합니다.
// 사이트는 회원에 대하여 영화및비디오물의진흥에관한법률 및 청소년보호법등에 따른 등급 및 연령 준수를 위해 이용제한이나 게시물 삭제 제한을 할 수 있습니다.
// </p>

// <h1>제6조 [회원정보의 변경]</h1>
// <p>
// 회원은 계졍설정화면을 통하여 언제든지 본인의 개인정보를 열람하고 수정할 수 있습니다. 다만, 서비스 관리를 위해 필요한 아이디, 이메일 등은 수정이 불가능합니다.
// 회원은 회원가입신청 시 기재한 사항이 변경되었을 경우 온라인으로 수정을 하거나 전자우편 기타 방법으로 사이트에 대하여 그 변경사항을 알려야 합니다.
// 제2항의 변경사항을 사이트에 알리지 않아 발생한 불이익에 대하여 사이트는 책임지지 않습니다.
// </p>

// <h1>제7조 [개인정보보호 의무]</h1>
// <p>
// 사이트는 정보통신망법 등 관계 법령이 정하는 바에 따라 회원의 개인정보를 보호하기 위해 노력합니다. 개인정보의 보호 및 사용에 대해서는 관련법 및 사이트의 개인정보취급방침이 적용됩니다. 다만, 사이트의 공식 사이트 이외의 링크된 사이트에서는 사이트의 개인정보취급방침이 적용되지 않습니다.
// </p>

// <h1>제8조 [회원의 아이디 및 비밀번호, 이메일 관리에 대한 의무]</h1>
// <p>
// 회원의 아이디와 비밀번호 그리고 이메일에 관한 관리책임은 회원에게 있으며, 이를 제3자가 이용하도록 하여서는 안 됩니다.
// 사이트는 회원의 아이디가 개인정보 유출 우려가 있거나, 반사회적 또는 미풍양속에 어긋나거나 사이트 및 사이트의 운영자로 오인한 우려가 있는 경우, 해당 아이디의 이용을 제한할 수 있습니다.
// 회원은 아이디 및 비밀번호가 도용되거나 제3자가 사용하고 있음을 인지한 경우에는 이를 즉시 사이트에 통지하고 사이트의 안내에 따라야 합니다.
// 제3항의 경우에 해당 회원이 사이트에 그 사실을 통지하지 않거나, 통지한 경우에도 사이트의 안내에 따르지 않아 발생한 불이익에 대하여 사이트는 책임지지 않습니다.
// </p>

// <h1>제9조 [회원에 대한 통지]</h1>
// <p>사이트가 회원에 대한 통지를 하는 경우 이 약관에 별도 규정이 없는 한 서비스 내 전자우편주소, 전자쪽지 등으로 할 수 있습니다.
// 사이트는 회원 전체에 대한 통지의 경우 7일 이상 사이트의 게시판에 게시함으로써 제1항의 통지에 갈음할 수 있습니다.
// </p>

// <h1>제10조 [사이트의 의무]</h1>
// <p>
// 사이트는 관련법과 이 약관이 금지하거나 미풍양속에 반하는 행위를 하지 않으며, 계속적이고 안정적으로 서비스를 제공하기 위하여 최선을 다하여 노력합니다.
// 사이트는 회원이 안전하게 서비스를 이용할 수 있도록 개인정보(신용정보 포함)보호를 위해 보안시스템을 갖추어야 하며 개인정보취급방침을 공시하고 준수합니다.
// 사이트는 서비스이용과 관련하여 회원으로부터 제기된 의견이나 불만이 정당하다고 인정할 경우에는 이를 처리하여야 합니다. 회원이 제기한 의견이나 불만사항에 대해서는 게시판, 전자우편 등을 통하여 회원에게 처리과정 및 결과를 전달합니다.
// </p>

// <h1>제11조 [회원의 의무]</h1>
// <p>
// 회원은 다음 행위를 하여서는 안 됩니다.
// 신청 또는 변경 시 허위내용의 등록
// 타인의 정보도용
// 사이트가 게시한 정보의 변경
// 사이트가 정한 정보 이외의 정보(컴퓨터 프로그램 등) 등의 송신 또는 게시
// 사이트와 기타 제3자의 저작권 등 지적재산권에 대한 침해
// 사이트 및 기타 제3자의 명예를 손상시키거나 업무를 방해하는 행위
// 외설 또는 폭력적인 메시지, 화상, 음성, 기타 공서양속에 반하는 정보를 서비스에 공개 또는 게시하는 행위
// 사이트의 동의 없이 영리를 목적으로 서비스를 사용하는 행위
// 회원은 관계법, 이 약관의 규정, 이용안내 및 서비스와 관련하여 공지한 주의사항, 사이트가 통지하는 사항 등을 준수하여야 하며, 기타 사이트의 업무에 방해되는 행위를 하여서는 안 됩니다.
// </p>

// <h1>제12조 [서비스의 제공]</h1>
// <p>
// 사이트는 회원에게 아래와 같은 서비스를 제공합니다.
// 음식 레시피를 작성할 수 있는 서비스
// 게시판 서비스
// 냉장고를 통한 유통기한 관리 및 레시피 추천 서비스
// 기타 사이트가 추가 개발하거나 다른 사이트와의 제휴계약 등을 통해 회원에게 제공하는 일체의 서비스
// 서비스 이용은 사이트의 업무상 또는 기술상 특별한 지장이 없는 한 연중무휴, 1일 24시간 운영을 원칙으로 합니다. 사이트의 책임이 없는 기술적 문제가 발생하거나 정기점검을 하는 경우는 예외로 합니다.
// 사이트는 일부 서비스의 이용 가능 시간을 별도로 정할 수 있습니다. 이 경우 서비스 이용안내를 통해 공지합니다.
// </p>
// <h1>제13조 [유료 서비스 거래 규정]</h1>
// <p>별도로 표시된 유료 서비스를 제외한 모든 서비스는 회원들에게 무료로 제공됩니다.
// 유료 서비스의 이용 요금 및 결제 방식은 해당 서비스에 명시되어 있는 규정에 따릅니다.
// 회원이 현금 및 사이버머니 등 거래에 필요한 내용을 확인하여 이에 승낙하면 거래가 성립된 것으로 간주합니다.</p>
// <h1>제14조 [관계 법령상 환불 정책]</h1>
// <p>
// 사이트의 본 약관상 환불규정 등은 약관의 규제에 관한 법률, 온라인 디지털콘텐츠산업 발전법, 전자상거래 등에서의 소비자보호에 관한 법률 등을 준수합니다.
// 전 항의 관계법령에 따른 소비자의 청약철회가 불가능한 경우는 다음과 같습니다.
// 청약철회가 불가능한 콘텐츠에 대한 사실을 표시사항에 포함한 경우
// 시용상품을 제공한 경우
// 한시적 또는 일부 이용 등의 방법을 제공한 경우
// </p>

// <h1>제15조 [사이트의 환불 규정]</h1>
// <p>
// 본 사이트에서는 제휴 프로그램이나 광고 링크를 통해 외부 사이트의 유료 서비스에 접속할 수 있습니다. 이러한 서비스에서 발생하는 결제 및 환불 문제는 해당 외부 서비스 제공자의 환불 규정에 따라 처리됩니다. 회원은 제휴된 외부 서비스의 환불 정책을 확인하고, 이와 관련된 문제는 외부 서비스 제공자에게 직접 문의해야 합니다.
// </p>

// <h1>제16조 [서비스 제공의 변경 및 중지]</h1>
// <p>
// 게시물이라 함은 회원이 서비스를 이용하면서 게시한 글, 사진, 각종 파일과 링크, 디지털 콘텐츠 등을 말합니다.
// 사이트는 무료로 제공되는 서비스의 일부 또는 전부를 사이트의 정책 및 운영의 필요상 수정, 중단, 변경할 수 있으며, 이에 대하여 관련법에 특별한 규정이 없는 한 회원에게 별도의 보상을 하지 않습니다.
// 사이트는 긴급한 시스템 점검, 증설 및 교체, 설비의 장애, 서비스 이용의 폭주, 정전, 국가비상사태, 천재지변 등 부득이한 사유가 발생한 경우 사전 예고 없이 일시적으로 서비스를 중지할 수 있습니다.
// </p>

// <h1>제17조 [회원의 게시물 등]</h1>
// <p>
// 게시물은 회원이 서비스를 이용하면서 게시한 글, 사진, 각종 파일과 링크, 디지털 콘텐츠 등을 말합니다.
// 회원이 서비스에 등록하는 게시물 등으로 인하여 본인 또는 타인에게 손해나 기타 문제가 발생하는 경우 회원은 이에 대한 전적인 책임을 지게 되며, 사이트는 이에 대하여 어떤 경우에도 책임을 지지 않습니다.
// 사이트는 다음 각 호에 해당하는 게시물 등을 회원의 사전 동의 없이 임시게시 중단, 수정, 삭제, 이동 또는 등록 거부 등의 관련 조치를 취할 수 있습니다.
// 다른 회원 또는 제 3자에게 심한 모욕을 주거나 명예를 손상시키는 내용인 경우
// 공공질서 및 미풍양속에 위반되는 내용을 유포하거나 링크시키는 경우
// 불법복제 또는 해킹을 조장하는 내용인 경우
// 영리를 목적으로 하는 광고일 경우
// 범죄와 결부된다고 객관적으로 인정되는 내용일 경우
// 다른 이용자 또는 제 3자의 저작권 등 기타 권리를 침해하는 내용인 경우
// 사적인 정치적 판단이나 종교적 견해의 내용으로 사이트가 서비스 성격에 부합하지 않는다고 판단하는 경우
// 사이트에서 규정한 게시물 원칙에 어긋나거나, 게시판 성격에 부합하지 않는 경우
// 게시물이 내용의 질 뿐만 아니라 화질 등에 있어 사이트가 정한 규정을 만족하지 못한 경우
// 기타 관계법령에 위배된다고 판단되는 경우
// 사이트는 게시물 등에 대하여 제3자로부터 명예훼손, 지적재산권 등의 권리 침해를 이유로 게시중단 요청을 받은 경우 이를 임시로 게시를 중단 할 수 있으며, 이의를 제기한 자와 게시물 등록자 간에 소송, 합의 등을 통해 당해 게시물에 관한 법적 문제가 종결된 후 이를 근거로 사이트에 신청이 있는 경우에만 상기 임시로 게시가 중단된 게시물은 다시 게시될 수 있습니다.
// 회원이 이용계약해지를 한 경우 회원이 등록한 게시물은 자동 삭제되지 않으며 이용계약 해지 전에 직접 삭제를 해야합니다.
// </p>

// <h1>제18조 [게시물에 대한 저작권]</h1>
// <p>
// 사이트가 작성한 게시물 또는 저작물에 대한 저작권 기타 지적재산권은 사이트에 귀속합니다.
// 회원이 서비스 내에 게시한 게시물의 저작권은 원칙적으로 게시한 회원에게 귀속됩니다. 단, 사이트는 서비스의 운영, 전시, 전송, 배포, 홍보 등의 목적으로 회원의 별도의 허락 없이 무상으로 회원이 등록한 게시물을 사용할 수 있습니다.
// 회원이 올린 디지털 콘텐츠가 회원의 동의 없이 타인에 의해 무단, 불법 복제되어 회원뿐 아니라 사이트의 이익에 상충할 경우 사이트는 회원을 대리해 저작권을 행사할 수 있습니다. 단, 이 경우 사이트는 회원에게 개별적 동의를 구합니다.
// 사이트는 본 조 제 2항 이외의 목적으로 회원의 게시물을 사용하고자 하는 경우 사전에 회원의 동의를 얻어 사용합니다.
// </p>

// <h1>제19조 [정보의 제공]</h1>
// <p>
// 사이트는 회원에게 서비스 이용에 필요가 있다고 인정되는 각종 정보에 대해서 전자우편이나 서신, 우편, SMS, 전화 등의 방법으로 회원에게 제공할 수 있습니다.
// 사이트는 서비스 개선 및 회원 대상의 서비스 소개 등의 목적으로 회원의 동의 하에 관련 법령에 따라 추가적인 개인 정보를 수집할 수 있습니다.
// </p>

// <h1>제20조 [광고게재 및 광고주와의 거래]</h1>
// <p>
// 사이트가 회원에게 서비스를 제공할 수 있는 서비스 투자기반의 일부는 광고게재를 통한 수익으로부터 나옵니다. 
// 회원이 이러한 광고를 클릭하거나 구매 활동을 진행할 경우 사이트 운영자는 일정한 대가를 받을 수 있습니다.
// 회원은 서비스 이용시 노출되는 광고게재에 대해 동의합니다.
// 사이트는 서비스상에 게재되어 있거나 서비스를 통한 광고주의 판촉활동에 회원이 참여하거나 교신 또는 거래를 함으로써 발생하는 손실과 손해에 대해 책임을 지지 않습니다.
// </p>

// <h1>제21조 [계약해제, 해지 등]</h1>
// <p>
// 회원은 언제든지 1:1문의 등을 통하여 이용계약 해지 신청을 할 수 있으며, 사이트는 관련법 등이 정하는 바에 따라 이를 즉시 처리하여야 합니다.
// 회원이 계약을 해지할 경우, 관련법 및 개인정보취급방침에 따라 사이트가 회원정보를 보유하는 경우를 제외하고는 해지 즉시 회원의 모든 데이터는 소멸됩니다.
// </p>

// <h1>제22조 [이용제한 등]</h1>
// <p>
// 사이트는 회원이 이 약관의 의무를 위반하거나 서비스의 정상적인 운영을 방해한 경우, 경고, 일시정지, 영구이용정지 등으로 서비스 이용을 제한할 수 있습니다.
// 사이트는 전항에도 불구하고, 주민등록법을 위반한 명의도용 및 결제도용, 저작권법 및 컴퓨터프로그램보호법을 위반한 불법프로그램의 제공 및 운영방해, 정보통신망법을 위반한 불법통신 및 해킹, 악성프로그램의 배포, 접속권한 초과행위 등과 같이 관련법을 위반한 경우에는 즉시 영구이용정지를 할 수 있습니다. 본 항에 따른 영구이용정지 시 서비스 이용을 통해 획득한 수익 등 기타 혜택 등도 모두 소멸되며, 사이트는 이에 대해 별도로 보상하지 않습니다.
// 사이트는 회원이 계속해서 1년 이상 로그인하지 않는 경우, 회원정보의 보호 및 운영의 효율성을 위해 이용을 제한할 수 있습니다.
// 사이트는 본 조의 이용제한 범위 내에서 제한의 조건 및 세부내용은 이용제한정책 및 개별 서비스상의 운영정책에서 정하는 바에 의합니다.
// 본 조에 따라 서비스 이용을 제한하거나 계약을 해지하는 경우에는 사이트는 그 사유 및 제한기간 등을 회원에게 알려야 합니다.
// 회원은 본 조에 따른 이용제한 등에 대해 사이트가 정한 절차에 따라 이의신청을 할 수 있습니다. 이 때 이의가 정당하다고 사이트가 인정하는 경우 사이트는 즉시 서비스의 이용을 재개합니다.
// </p>

// <h1>제23조 [부정이용 금지 및 차단]</h1>
// <p>
// 사이트는 다음 각호에 해당하는 경우를 부정 이용행위로 봅니다.
// 다른 사람의 저작물을 무단으로 복제하여 게시하거나, 타인의 지적 재산권을 침해하는 행위.
// 게시판 성격에 관련 없는 광고나 스팸을 게시하는 행위.
// 글쓰기 게시판에서 타인의 개인정보를 무단으로 공개하거나, 허위의 정보를 게시하는 행위.
// 사이트 내의 프로그램이나 서비스를 악용하여 부정한 방법으로 서비스를 이용하는 행위.
// 자신의 계정의 서비스를 타인에게 판매, 대여, 양도하는 행위 및 이를 광고하는 행위
// 사이트는 전항에 따른 부정 이용자가 발견 되었을 경우, 다음 각호에 따른 조치를 취할 수 있습니다.
// [1차 발견 시] 일정한 기간동한 활동이 정지됩니다.
// [2차 발견 시] 강제 탈퇴 처리되며 사이트의 법률 대리인을 통한 고발조치와 민사소송을 진행하게 됩니다.
// 회원은 전항 제2호의 조치를 이유로, 서비스 이용기간의 연장을 요구할 수 없습니다.
// 회원은 사이트로부터의 본 조 제2항의 조치에 이의가 있는 경우, 사이트의 법률 대리인을 통해 소명할 수 있습니다.
// 부정이용 식별방법 및 차단
// 사이트는 회원의 서비스 이용 중에 수집ㆍ확인된 IP정보 등의 자료를 토대로, 서버를 통하여 부정이용 여부를 분류ㆍ확인합니다.
// 사이트는 이용자가 서비스 이용 중에 복제프로그램을 실행시키거나 동일한 계정으로 동시 접속을 하는 경우, 서비스 이용 접속을 강제로 종료 시킵니다.
// </p>

// <h1>제24조 [면책]</h1>
// <p>
// 사이트는 천재지변 또는 이에 준하는 불가항력으로 인하여 서비스를 제공할 수 없는 경우에는 서비스 제공에 관한 책임이 면제됩니다.
// 사이트는 회원의 귀책사유로 인한 서비스 이용의 장애에 대하여는 책임을 지지 않습니다.
// 사이트는 회원이 서비스와 관련하여 게재한 정보, 자료, 사실의 신뢰도, 정확성 등의 내용에 관하여는 책임을 지지 않습니다.
// 사이트는 회원 간 또는 회원과 제3자 상호간에 서비스를 매개로 하여 거래 등을 한 경우에는 책임이 면제됩니다.
// 사이트는 무료로 제공되는 서비스 이용과 관련하여 관련법에 특별한 규정이 없는 한 책임을 지지 않습니다.
// 사이트는 회원이 작성하는 등의 방법으로 서비스에 게재된 정보, 자료, 사실의 신뢰도, 정확성 등에 대해서는 보증을 하지 않으며 이로 인해 발생한 회원의 손해에 대하여는 책임을 부담하지 아니합니다.
// </p>

// <h1>제25조 [분쟁의 해결]</h1>
// <p>
// 본 약관은 대한민국법령에 의하여 규정되고 이행되며, 서비스 이용과 관련하여 사이트와 회원간에 발생한 분쟁에 대해서는 서울중앙지방법원을 합의관할로 합니다.
// </p>

// <h1>제26조 [규정의 준용]</h1>
// <p>
// 본 약관에 명시되지 않은 사항에 대해서는 관련법령에 의하고, 법에 명시되지 않은 부분에 대하여는 관습에 의합니다.
// </p>

// <h3>
// 부칙
// </h3>
// <p>
// 본 약관은 2024년 11월 21일부터 적용됩니다.
// </p>
//         </>
//     )
// }